InformationRegisters/СведенияОСтавкахИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНерезиденты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПревышенияНерезиденты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахИПН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОСтавкахИПН();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахИПН() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахИПН.СоздатьНаборЗаписей();

	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	10.0, 10.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Вознаграждения,			10.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды,				5.0,  15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Выигрыши,				 	10.0, 20.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0, 20.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ПрочиеДоходы,			 	10.0, 20.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20230101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды,				10.0, 15.0);
	
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды,				5.0,  15.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	10.0, 10.0, 15.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Вознаграждения,			10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Выигрыши,				 	10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ПрочиеДоходы,			 	10.0, 15.0, 20.0, 20.0);
   
    НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахИПН(НаборЗаписей, Период, Организация, ВидДохода, Ставка, СтавкаНерезиденты, СтавкаПревышения = 0, СтавкаПревышенияНерезиденты = 0)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.Организация = Организация;  
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Ставка = Ставка;
	НоваяЗапись.СтавкаНерезиденты = СтавкаНерезиденты;
	НоваяЗапись.СтавкаПревышения = СтавкаПревышения;
	НоваяЗапись.СтавкаПревышенияНерезиденты = СтавкаПревышенияНерезиденты;
	
КонецПроцедуры	

Процедура ДобавитьСведенияОСтавкахИПНСПроверкой(Период, Организация, ВидДохода, Ставка, СтавкаНерезиденты, СтавкаПревышения = 0, СтавкаПревышенияНерезиденты = 0) 
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахИПН.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Организация, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.Организация = Организация;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.Ставка = Ставка;
		Движение.СтавкаПревышения = СтавкаПревышения;
		Движение.СтавкаНерезиденты = СтавкаНерезиденты;
		Движение.СтавкаПревышенияНерезиденты = СтавкаПревышенияНерезиденты;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСведенияОСтавкахИПН2023() Экспорт
	
	ДобавитьСведенияОСтавкахИПНСПроверкой('20230101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды, 10.0, 15.0);  

КонецПроцедуры

Процедура ОбновитьСведенияОСтавкахИПН2026() Экспорт
	
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды,				5.0,  15.0, 15.0);
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	10.0, 10.0, 15.0, 15.0);
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Вознаграждения,			10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Выигрыши,				 	10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0, 20.0, 15.0);
	ДобавитьСведенияОСтавкахИПНСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ПрочиеДоходы,			 	10.0, 20.0, 20.0, 20.0);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
